deployments/llm-d-infra-xks-gke-tpu-native-gateway/benchmarks/results/ab_1req_1c_20260211_213022.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 35.214.195.39 (be patient).....done


Server Software:        
Server Hostname:        35.214.195.39
Server Port:            80

Document Path:          /llm-d-inference-scheduling/qwen2-3b-pattern1/v1/completions
Document Length:        16 bytes

Concurrency Level:      1
Time taken for tests:   1.305 seconds
Complete requests:      1
Failed requests:        0
Non-2xx responses:      1
Total transferred:      168 bytes
Total body sent:        336
HTML transferred:       16 bytes
Requests per second:    0.77 [#/sec] (mean)
Time per request:       1304.718 [ms] (mean)
Time per request:       1304.718 [ms] (mean, across all concurrent requests)
Transfer rate:          0.13 [Kbytes/sec] received
                        0.25 kb/s sent
                        0.38 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      151  151   0.0    151     151
Processing:  1153 1153   0.0   1153    1153
Waiting:      167  167   0.0    167     167
Total:       1305 1305   0.0   1305    1305